ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F435_437/at32f435_437rx.h
/******************  Bit definition for CRM_AHBEN1 register  ******************/
#define CRM_AHBEN1_GPIOAEN_Pos              (0U)
#define CRM_AHBEN1_GPIOAEN_Msk              (0x1U << CRM_AHBEN1_GPIOAEN_Pos)        /*!< 0x00000001 */
#define CRM_AHBEN1_GPIOAEN                  CRM_AHBEN1_GPIOAEN_Msk                  /*!< IO port A clock enable */
#define CRM_AHBEN1_GPIOBEN_Pos              (1U)
#define CRM_AHBEN1_GPIOBEN_Msk              (0x1U << CRM_AHBEN1_GPIOBEN_Pos)        /*!< 0x00000002 */
#define CRM_AHBEN1_GPIOBEN                  CRM_AHBEN1_GPIOBEN_Msk                  /*!< IO port B clock enable */
#define CRM_AHBEN1_GPIOCEN_Pos              (2U)
#define CRM_AHBEN1_GPIOCEN_Msk              (0x1U << CRM_AHBEN1_GPIOCEN_Pos)        /*!< 0x00000004 */
#define CRM_AHBEN1_GPIOCEN                  CRM_AHBEN1_GPIOCEN_Msk                  /*!< IO port C clock enable */
#define CRM_AHBEN1_GPIODEN_Pos              (3U)
#define CRM_AHBEN1_GPIODEN_Msk              (0x1U << CRM_AHBEN1_GPIODEN_Pos)        /*!< 0x00000008 */
#define CRM_AHBEN1_GPIODEN                  CRM_AHBEN1_GPIODEN_Msk                  /*!< IO port D clock enable */
#define CRM_AHBEN1_GPIOEEN_Pos              (4U)
#define CRM_AHBEN1_GPIOEEN_Msk              (0x1U << CRM_AHBEN1_GPIOEEN_Pos)        /*!< 0x00000010 */
#define CRM_AHBEN1_GPIOEEN                  CRM_AHBEN1_GPIOEEN_Msk                  /*!< IO port E clock enable */
#define CRM_AHBEN1_GPIOFEN_Pos              (5U)
#define CRM_AHBEN1_GPIOFEN_Msk              (0x1U << CRM_AHBEN1_GPIOFEN_Pos)        /*!< 0x00000020 */
#define CRM_AHBEN1_GPIOFEN                  CRM_AHBEN1_GPIOFEN_Msk                  /*!< IO port F clock enable */
#define CRM_AHBEN1_GPIOGEN_Pos              (6U)
#define CRM_AHBEN1_GPIOGEN_Msk              (0x1U << CRM_AHBEN1_GPIOGEN_Pos)        /*!< 0x00000040 */
#define CRM_AHBEN1_GPIOGEN                  CRM_AHBEN1_GPIOGEN_Msk                  /*!< IO port G clock enable */
#define CRM_AHBEN1_GPIOHEN_Pos              (7U)
#define CRM_AHBEN1_GPIOHEN_Msk              (0x1U << CRM_AHBEN1_GPIOHEN_Pos)        /*!< 0x00000080 */
#define CRM_AHBEN1_GPIOHEN                  CRM_AHBEN1_GPIOHEN_Msk                  /*!< IO port H clock enable */
#define CRM_AHBEN1_CRCEN_Pos                (12U)
#define CRM_AHBEN1_CRCEN_Msk                (0x1U << CRM_AHBEN1_CRCEN_Pos)          /*!< 0x00001000 */
#define CRM_AHBEN1_CRCEN                    CRM_AHBEN1_CRCEN_Msk                    /*!< CRC clock enable */
#define CRM_AHBEN1_EDMAEN_Pos               (21U)
#define CRM_AHBEN1_EDMAEN_Msk               (0x1U << CRM_AHBEN1_EDMAEN_Pos)         /*!< 0x00200000 */
#define CRM_AHBEN1_EDMAEN                   CRM_AHBEN1_EDMAEN_Msk                   /*!< EDMA clock enable */
#define CRM_AHBEN1_DMA1EN_Pos               (22U)
#define CRM_AHBEN1_DMA1EN_Msk               (0x1U << CRM_AHBEN1_DMA1EN_Pos)         /*!< 0x00400000 */
#define CRM_AHBEN1_DMA1EN                   CRM_AHBEN1_DMA1EN_Msk                   /*!< DMA1 clock enable */
#define CRM_AHBEN1_DMA2EN_Pos               (24U)
#define CRM_AHBEN1_DMA2EN_Msk               (0x1U << CRM_AHBEN1_DMA2EN_Pos)         /*!< 0x01000000 */
#define CRM_AHBEN1_DMA2EN                   CRM_AHBEN1_DMA2EN_Msk                   /*!< DMA2 clock enable */
#define CRM_AHBEN1_EMACEN_Pos               (25U)
#define CRM_AHBEN1_EMACEN_Msk               (0x1U << CRM_AHBEN1_EMACEN_Pos)         /*!< 0x02000000 */
#define CRM_AHBEN1_EMACEN                   CRM_AHBEN1_EMACEN_Msk                   /*!< EMAC clock enable */
#define CRM_AHBEN1_EMACTXEN_Pos             (26U)
#define CRM_AHBEN1_EMACTXEN_Msk             (0x1U << CRM_AHBEN1_EMACTXEN_Pos)       /*!< 0x04000000 */
#define CRM_AHBEN1_EMACTXEN                 CRM_AHBEN1_EMACTXEN_Msk                 /*!< EMACTX clock enable */
#define CRM_AHBEN1_EMACRXEN_Pos             (27U)
#define CRM_AHBEN1_EMACRXEN_Msk             (0x1U << CRM_AHBEN1_EMACRXEN_Pos)       /*!< 0x08000000 */
#define CRM_AHBEN1_EMACRXEN                 CRM_AHBEN1_EMACRXEN_Msk                 /*!< EMACRX clock enable */
#define CRM_AHBEN1_EMACPTPEN_Pos            (28U)
#define CRM_AHBEN1_EMACPTPEN_Msk            (0x1U << CRM_AHBEN1_EMACPTPEN_Pos)       /*!< 0x10000000 */
#define CRM_AHBEN1_EMACPTPEN                CRM_AHBEN1_EMACPTPEN_Msk                 /*!< EMACPTP clock enable */
#define CRM_AHBEN1_OTGFS2EN_Pos             (29U)
#define CRM_AHBEN1_OTGFS2EN_Msk             (0x1U << CRM_AHBEN1_OTGFS2EN_Pos)        /*!< 0x20000000 */
#define CRM_AHBEN1_OTGFS2EN                 CRM_AHBEN1_OTGFS2EN_Msk                  /*!< OTGFS2 clock enable */

/******************  Bit definition for CRM_AHBEN2 register  ******************/
#define CRM_AHBEN2_DVPEN_Pos                (0U)
#define CRM_AHBEN2_DVPEN_Msk                (0x1U << CRM_AHBEN2_DVPEN_Pos)          /*!< 0x00000001 */
#define CRM_AHBEN2_DVPEN                    CRM_AHBEN2_DVPEN_Msk                    /*!< DVP clock enable */
#define CRM_AHBEN2_OTGFSEN_Pos              (7U)
#define CRM_AHBEN2_OTGFSEN_Msk              (0x1U << CRM_AHBEN2_OTGFSEN_Pos)        /*!< 0x00000080 */
#define CRM_AHBEN2_OTGFSEN                  CRM_AHBEN2_OTGFSEN_Msk                  /*!< OTGFS clock enable */
#define CRM_AHBEN2_SDIO1EN_Pos              (15U)
#define CRM_AHBEN2_SDIO1EN_Msk              (0x1U << CRM_AHBEN2_SDIO1EN_Pos)        /*!< 0x00008000 */
#define CRM_AHBEN2_SDIO1EN                  CRM_AHBEN2_SDIO1EN_Msk                  /*!< SDIO1 clock enable */

/******************  Bit definition for CRM_AHBEN3 register  ******************/
#define CRM_AHBEN3_XMCEN_Pos                (0U)
#define CRM_AHBEN3_XMCEN_Msk                (0x1U << CRM_AHBEN3_XMCEN_Pos)          /*!< 0x00000001 */
#define CRM_AHBEN3_XMCEN                    CRM_AHBEN3_XMCEN_Msk                    /*!< XMC clock enable */
#define CRM_AHBEN3_QSPI1EN_Pos              (1U)
#define CRM_AHBEN3_QSPI1EN_Msk              (0x1U << CRM_AHBEN3_QSPI1EN_Pos)        /*!< 0x00000002 */
#define CRM_AHBEN3_QSPI1EN                  CRM_AHBEN3_QSPI1EN_Msk                  /*!< QSPI1 clock enable */
#define CRM_AHBEN3_QSPI2EN_Pos              (14U)
#define CRM_AHBEN3_QSPI2EN_Msk              (0x1U << CRM_AHBEN3_QSPI2EN_Pos)        /*!< 0x00004000 */
#define CRM_AHBEN3_QSPI2EN                  CRM_AHBEN3_QSPI2EN_Msk                  /*!< QSPI2 clock enable */
#define CRM_AHBEN3_SDIO2EN_Pos              (15U)
#define CRM_AHBEN3_SDIO2EN_Msk              (0x1U << CRM_AHBEN3_SDIO2EN_Pos)        /*!< 0x00008000 */
#define CRM_AHBEN3_SDIO2EN                  CRM_AHBEN3_SDIO2EN_Msk                  /*!< SDIO2 clock enable */

