ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F435_437/at32f435_437rx.h
/* Legacy defines */
#define PWC_CTRL_PVMSEL_2V3                 PWC_CTRL_PVMSEL_LEV1
#define PWC_CTRL_PVMSEL_2V4                 PWC_CTRL_PVMSEL_LEV2
#define PWC_CTRL_PVMSEL_2V5                 PWC_CTRL_PVMSEL_LEV3
#define PWC_CTRL_PVMSEL_2V6                 PWC_CTRL_PVMSEL_LEV4
#define PWC_CTRL_PVMSEL_2V7                 PWC_CTRL_PVMSEL_LEV5
#define PWC_CTRL_PVMSEL_2V8                 PWC_CTRL_PVMSEL_LEV6
#define PWC_CTRL_PVMSEL_2V9                 PWC_CTRL_PVMSEL_LEV7

#define PWC_CTRL_BPWEN_Pos                  (8U)
#define PWC_CTRL_BPWEN_Msk                  (0x1U << PWC_CTRL_BPWEN_Pos)            /*!< 0x00000100 */
#define PWC_CTRL_BPWEN                      PWC_CTRL_BPWEN_Msk                      /*!< Battery powered domain write enable */

/*****************  Bit definition for PWC_CTRLSTS register  ******************/
#define PWC_CTRLSTS_SWEF_Pos                (0U)
#define PWC_CTRLSTS_SWEF_Msk                (0x1U << PWC_CTRLSTS_SWEF_Pos)          /*!< 0x00000001 */
#define PWC_CTRLSTS_SWEF                    PWC_CTRLSTS_SWEF_Msk                    /*!< Standby wake-up event flag */
#define PWC_CTRLSTS_SEF_Pos                 (1U)
#define PWC_CTRLSTS_SEF_Msk                 (0x1U << PWC_CTRLSTS_SEF_Pos)           /*!< 0x00000002 */
#define PWC_CTRLSTS_SEF                     PWC_CTRLSTS_SEF_Msk                     /*!< Standby mode entry flag */
#define PWC_CTRLSTS_PVMOF_Pos               (2U)
#define PWC_CTRLSTS_PVMOF_Msk               (0x1U << PWC_CTRLSTS_PVMOF_Pos)         /*!< 0x00000004 */
#define PWC_CTRLSTS_PVMOF                   PWC_CTRLSTS_PVMOF_Msk                   /*!< Power voltage monitoring output flag */
#define PWC_CTRLSTS_SWPEN1_Pos              (8U)
#define PWC_CTRLSTS_SWPEN1_Msk              (0x1U << PWC_CTRLSTS_SWPEN1_Pos)        /*!< 0x00000100 */
#define PWC_CTRLSTS_SWPEN1                  PWC_CTRLSTS_SWPEN1_Msk                  /*!< Standby wake-up pin 1 enable */
#define PWC_CTRLSTS_SWPEN2_Pos              (9U)
#define PWC_CTRLSTS_SWPEN2_Msk              (0x1U << PWC_CTRLSTS_SWPEN2_Pos)        /*!< 0x00000200 */
#define PWC_CTRLSTS_SWPEN2                  PWC_CTRLSTS_SWPEN2_Msk                  /*!< Standby wake-up pin 2 enable */

/******************  Bit definition for PWC_LDOOV register  *******************/
/*!< LDOOVSEL congiguration */
#define PWC_LDOOV_LDOOVSEL_Pos              (0U)
#define PWC_LDOOV_LDOOVSEL_Msk              (0x7U << PWC_LDOOV_LDOOVSEL_Pos)        /*!< 0x00000003 */
#define PWC_LDOOV_LDOOVSEL                  PWC_LDOOV_LDOOVSEL_Msk                  /*!< LDOOVSEL[2:0] bits (Voltage regulator output voltage select) */
#define PWC_LDOOV_LDOOVSEL_0                (0x1U << PWC_LDOOV_LDOOVSEL_Pos)        /*!< 0x00000001 */
#define PWC_LDOOV_LDOOVSEL_1                (0x2U << PWC_LDOOV_LDOOVSEL_Pos)        /*!< 0x00000002 */
#define PWC_LDOOV_LDOOVSEL_2                (0x4U << PWC_LDOOV_LDOOVSEL_Pos)        /*!< 0x00000004 */

#define PWC_LDOOV_LDOOVSEL_LEV1             0x00000004U                             /*!< Voltage output level 1.1V */
#define PWC_LDOOV_LDOOVSEL_LEV2             0x00000000U                             /*!< Voltage output level 1.2V */
#define PWC_LDOOV_LDOOVSEL_LEV3             0x00000001U                             /*!< Voltage output level 1.3V */

/* Legacy defines */
#define PWC_LDOOV_LDOOVSEL_1V1              PWC_LDOOV_LDOOVSEL_LEV1
#define PWC_LDOOV_LDOOVSEL_1V2              PWC_LDOOV_LDOOVSEL_LEV2
#define PWC_LDOOV_LDOOVSEL_1V3              PWC_LDOOV_LDOOVSEL_LEV3

/******************************************************************************/
/*                                                                            */
/*                Flash and User System Data Registers (FLASH)                */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for FLASH_PSR register  ******************/
#define FLASH_PSR_NZW_BST_STS_Pos           (13UL)                                  /*!< NZW_BST_STS (Bit 13) */
#define FLASH_PSR_NZW_BST_STS_Msk           (0x1U << FLASH_PSR_NZW_BST_STS_Pos)     /*!< NZW_BST_STS (Bitfield-Mask: 0x01) */
#define FLASH_PSR_NZW_BST_STS               FLASH_PSR_NZW_BST_STS_Msk               /*!< Flash non-zero wait area boost status */
#define FLASH_PSR_NZW_BST_Pos               (12UL)                                  /*!< NZW_BST (Bit 12) */
#define FLASH_PSR_NZW_BST_Msk               (0x1U << FLASH_PSR_NZW_BST_Pos)         /*!< NZW_BST (Bitfield-Mask: 0x01) */
#define FLASH_PSR_NZW_BST                   FLASH_PSR_NZW_BST_Msk

/*****************  Bit definition for FLASH_UNLOCK register  *****************/
#define FLASH_UNLOCK_UKVAL_Pos              (0U)
#define FLASH_UNLOCK_UKVAL_Msk              (0xFFFFFFFFU << FLASH_UNLOCK_UKVAL_Pos) /*!< 0xFFFFFFFF */
#define FLASH_UNLOCK_UKVAL                  FLASH_UNLOCK_UKVAL_Msk                  /*!< Unlock key value */

#define FAP_KEY_Pos                         (0U)
#define FAP_KEY_Msk                         (0xA5U << FAP_KEY_Pos)                  /*!< 0x000000A5 */
#define FAP_KEY                             FAP_KEY_Msk                             /*!< Flash access protection key */
#define FLASH_KEY1_Pos                      (0U)
#define FLASH_KEY1_Msk                      (0x45670123U << FLASH_KEY1_Pos)         /*!< 0x45670123 */
#define FLASH_KEY1                          FLASH_KEY1_Msk                          /*!< Flash key 1 */
#define FLASH_KEY2_Pos                      (0U)
#define FLASH_KEY2_Msk                      (0xCDEF89ABU << FLASH_KEY2_Pos)         /*!< 0xCDEF89AB */
#define FLASH_KEY2                          FLASH_KEY2_Msk                          /*!< Flash key 2 */

/***************  Bit definition for FLASH_USD_UNLOCK register  ***************/
#define FLASH_USD_UNLOCK_USD_UKVAL_Pos      (0U)                                    /*!< 0xFFFFFFFF */
#define FLASH_USD_UNLOCK_USD_UKVAL_Msk      (0xFFFFFFFFU << FLASH_USD_UNLOCK_USD_UKVAL_Pos)
#define FLASH_USD_UNLOCK_USD_UKVAL          FLASH_USD_UNLOCK_USD_UKVAL_Msk          /*!< User system data unlock key value */

#define FLASH_USDKEY1                       FLASH_KEY1                              /*!< User system data key 1 */
#define FLASH_USDKEY2                       FLASH_KEY2                              /*!< User system data key 2 */

/******************  Bit definition for FLASH_STS register  *******************/
#define FLASH_STS_OBF_Pos                   (0U)
#define FLASH_STS_OBF_Msk                   (0x1U << FLASH_STS_OBF_Pos)             /*!< 0x00000001 */
#define FLASH_STS_OBF                       FLASH_STS_OBF_Msk                       /*!< Operation busy flag */
#define FLASH_STS_PRGMERR_Pos               (2U)
#define FLASH_STS_PRGMERR_Msk               (0x1U << FLASH_STS_PRGMERR_Pos)         /*!< 0x00000004 */
#define FLASH_STS_PRGMERR                   FLASH_STS_PRGMERR_Msk                   /*!< Programming error */
#define FLASH_STS_EPPERR_Pos                (4U)
#define FLASH_STS_EPPERR_Msk                (0x1U << FLASH_STS_EPPERR_Pos)          /*!< 0x00000010 */
#define FLASH_STS_EPPERR                    FLASH_STS_EPPERR_Msk                    /*!< Erase/program protection error */
#define FLASH_STS_ODF_Pos                   (5U)
#define FLASH_STS_ODF_Msk                   (0x1U << FLASH_STS_ODF_Pos)             /*!< 0x00000020 */
#define FLASH_STS_ODF                       FLASH_STS_ODF_Msk                       /*!< Operation done flag */

/******************  Bit definition for FLASH_CTRL register  ******************/
#define FLASH_CTRL_FPRGM_Pos                (0U)
#define FLASH_CTRL_FPRGM_Msk                (0x1U << FLASH_CTRL_FPRGM_Pos)          /*!< 0x00000001 */
#define FLASH_CTRL_FPRGM                    FLASH_CTRL_FPRGM_Msk                    /*!< Flash program */
#define FLASH_CTRL_SECERS_Pos               (1U)
#define FLASH_CTRL_SECERS_Msk               (0x1U << FLASH_CTRL_SECERS_Pos)         /*!< 0x00000002 */
#define FLASH_CTRL_SECERS                   FLASH_CTRL_SECERS_Msk                   /*!< Page erase */
#define FLASH_CTRL_BANKERS_Pos              (2U)
#define FLASH_CTRL_BANKERS_Msk              (0x1U << FLASH_CTRL_BANKERS_Pos)        /*!< 0x00000004 */
#define FLASH_CTRL_BANKERS                  FLASH_CTRL_BANKERS_Msk                  /*!< Bank erase */
#define FLASH_CTRL_BLKERS_Pos               (2U)
#define FLASH_CTRL_BLKERS_Msk               (0x1U << FLASH_CTRL_BLKERS_Pos)         /*!< 0x00000008 */
#define FLASH_CTRL_BLKERS                   FLASH_CTRL_BLKERS_Msk                   /*!< Block erase */
#define FLASH_CTRL_USDPRGM_Pos              (4U)
#define FLASH_CTRL_USDPRGM_Msk              (0x1U << FLASH_CTRL_USDPRGM_Pos)        /*!< 0x00000010 */
#define FLASH_CTRL_USDPRGM                  FLASH_CTRL_USDPRGM_Msk                  /*!< User system data program */
#define FLASH_CTRL_USDERS_Pos               (5U)
#define FLASH_CTRL_USDERS_Msk               (0x1U << FLASH_CTRL_USDERS_Pos)         /*!< 0x00000020 */
#define FLASH_CTRL_USDERS                   FLASH_CTRL_USDERS_Msk                   /*!< User system data erase */
#define FLASH_CTRL_ERSTR_Pos                (6U)
#define FLASH_CTRL_ERSTR_Msk                (0x1U << FLASH_CTRL_ERSTR_Pos)          /*!< 0x00000040 */
#define FLASH_CTRL_ERSTR                    FLASH_CTRL_ERSTR_Msk                    /*!< Erase start */
#define FLASH_CTRL_OPLK_Pos                 (7U)
#define FLASH_CTRL_OPLK_Msk                 (0x1U << FLASH_CTRL_OPLK_Pos)           /*!< 0x00000080 */
#define FLASH_CTRL_OPLK                     FLASH_CTRL_OPLK_Msk                     /*!< Operation lock */
#define FLASH_CTRL_USDULKS_Pos              (9U)
#define FLASH_CTRL_USDULKS_Msk              (0x1U << FLASH_CTRL_USDULKS_Pos)        /*!< 0x00000200 */
#define FLASH_CTRL_USDULKS                  FLASH_CTRL_USDULKS_Msk                  /*!< User system data unlock success */
#define FLASH_CTRL_ERRIE_Pos                (10U)
#define FLASH_CTRL_ERRIE_Msk                (0x1U << FLASH_CTRL_ERRIE_Pos)          /*!< 0x00000400 */
#define FLASH_CTRL_ERRIE                    FLASH_CTRL_ERRIE_Msk                    /*!< Error interrupt enable */
#define FLASH_CTRL_ODFIE_Pos                (12U)
#define FLASH_CTRL_ODFIE_Msk                (0x1U << FLASH_CTRL_ODFIE_Pos)          /*!< 0x00001000 */
#define FLASH_CTRL_ODFIE                    FLASH_CTRL_ODFIE_Msk                    /*!< Operation done flag interrupt enable */

/******************  Bit definition for FLASH_ADDR register  ******************/
#define FLASH_ADDR_FA_Pos                   (0U)
#define FLASH_ADDR_FA_Msk                   (0xFFFFFFFFU << FLASH_ADDR_FA_Pos)      /*!< 0xFFFFFFFF */
#define FLASH_ADDR_FA                       FLASH_ADDR_FA_Msk                       /*!< Flash address */

/******************  Bit definition for FLASH_USD register  *******************/
#define FLASH_USD_USDERR_Pos                (0U)
#define FLASH_USD_USDERR_Msk                (0x1U << FLASH_USD_USDERR_Pos)          /*!< 0x00000001 */
#define FLASH_USD_USDERR                    FLASH_USD_USDERR_Msk                    /*!< User system data error */
#define FLASH_USD_FAP_Pos                   (1U)
#define FLASH_USD_FAP_Msk                   (0x1U << FLASH_USD_FAP_Pos)             /*!< 0x00000002 */
#define FLASH_USD_FAP                       FLASH_USD_FAP_Msk                       /*!< Flash access protection */

/*!< SSB congiguration */
#define FLASH_USD_WDT_ATO_EN_Pos            (2U)
#define FLASH_USD_WDT_ATO_EN_Msk            (0x1U << FLASH_USD_WDT_ATO_EN_Pos)      /*!< 0x00000004 */
#define FLASH_USD_WDT_ATO_EN                FLASH_USD_WDT_ATO_EN_Msk                /*!< nWDT_ATO_EN */
#define FLASH_USD_DEPSLP_RST_Pos            (3U)
#define FLASH_USD_DEPSLP_RST_Msk            (0x1U << FLASH_USD_DEPSLP_RST_Pos)      /*!< 0x00000008 */
#define FLASH_USD_DEPSLP_RST                FLASH_USD_DEPSLP_RST_Msk                /*!< nDEPSLP_RST */
#define FLASH_USD_STDBY_RST_Pos             (4U)
#define FLASH_USD_STDBY_RST_Msk             (0x1U << FLASH_USD_STDBY_RST_Pos)       /*!< 0x00000010 */
#define FLASH_USD_STDBY_RST                 FLASH_USD_STDBY_RST_Msk                 /*!< nSTDBY_RST */
#define FLASH_USD_BTOPT_Pos                 (5U)
#define FLASH_USD_BTOPT_Msk                 (0x1U << FLASH_USD_BTOPT_Pos)           /*!< 0x00000040 */
#define FLASH_USD_BTOPT                     FLASH_USD_BTOPT_Msk                     /*!< BTOPT */
#define FLASH_USD_DEPSLP_WDT_Pos            (7U)
#define FLASH_USD_DEPSLP_WDT_Msk            (0x1U << FLASH_USD_DEPSLP_WDT_Pos)      /*!< 0x00000080 */
#define FLASH_USD_DEPSLP_WDT                FLASH_USD_DEPSLP_WDT_Msk                /*!< nDEPSLP_WDT */
#define FLASH_USD_STDBY_WDT_Pos             (8U)
#define FLASH_USD_STDBY_WDT_Msk             (0x1U << FLASH_USD_STDBY_WDT_Pos)       /*!< 0x00000100 */
#define FLASH_USD_STDBY_WDT                 FLASH_USD_STDBY_WDT_Msk                 /*!< nSTDBY_WDT */
#define FLASH_USD_USER_D0_Pos               (10U)
#define FLASH_USD_USER_D0_Msk               (0xFFU << FLASH_USD_USER_D0_Pos)        /*!< 0x0003FC00 */
#define FLASH_USD_USER_D0                   FLASH_USD_USER_D0_Msk                   /*!< User data 0 */
#define FLASH_USD_USER_D1_Pos               (18U)
#define FLASH_USD_USER_D1_Msk               (0xFFU << FLASH_USD_USER_D1_Pos)        /*!< 0x03FC0000 */
#define FLASH_USD_USER_D1                   FLASH_USD_USER_D1_Msk                   /*!< User data 1 */

/******************  Bit definition for FLASH_EPPS0 register  ******************/
#define FLASH_EPPS0_EPPS_Pos                (0U)
#define FLASH_EPPS0_EPPS_Msk                (0xFFFFFFFFU << FLASH_EPPS0_EPPS_Pos)    /*!< 0xFFFFFFFF */
#define FLASH_EPPS0_EPPS                    FLASH_EPPS0_EPPS_Msk                     /*!< Erase/Program protection status */

/******************  Bit definition for FLASH_EPPS1 register  ******************/
#define FLASH_EPPS1_EPPS_Pos                (0U)
#define FLASH_EPPS1_EPPS_Msk                (0xFFFFFFFFU << FLASH_EPPS1_EPPS_Pos)    /*!< 0xFFFFFFFF */
#define FLASH_EPPS1_EPPS                    FLASH_EPPS1_EPPS_Msk                     /*!< Erase/Program protection status */

/******************  Bit definition for FLASH_CONTR register  ******************/
#define FLASH_CONTR_FCONTR_EN_Pos           (31U)
#define FLASH_CONTR_FCONTR_EN_Msk           (0x1U << FLASH_CONTR_FCONTR_EN_Pos)       /*!< 0x80000000 */
#define FLASH_CONTR_FCONTR_EN               FLASH_CONTR_FCONTR_EN_Msk                 /*!< Erase/Program protection status */

/******************  Bit definition for FLASH_DIVR register  ******************/
#define FLASH_DIVR_FDIV_Pos                 (0U)
#define FLASH_DIVR_FDIV_Msk                 (0x3U << FLASH_DIVR_FDIV_Pos)             /*!< 0x80000000 */
#define FLASH_DIVR_FDIV                     FLASH_DIVR_FDIV_Msk                       /*!< Erase/Program protection status */
#define FLASH_DIVR_FDIV_0                   (0x00000001)
#define FLASH_DIVR_FDIV_1                   (0x00000002)

#define FLASH_DIVR_FDIV_DIV2                (0x00000000)
#define FLASH_DIVR_FDIV_DIV3                (0x00000001)
#define FLASH_DIVR_FDIV_DIV4                (0x00000002)

/******************************************************************************/
/*                                                                            */
/*       General-purpose I/Os (GPIO) & Multiplex function I/Os (IOMUX)        */
/*                                                                            */
/******************************************************************************/
/******************  Bit definition for GPIO_CFGR register  *******************/
#define GPIO_CFGR_IOMC_Pos                  (0U)
#define GPIO_CFGR_IOMC_Msk                  (0xFFFFFFFFU << GPIO_CFGR_IOMC_Pos)     /*!< 0xFFFFFFFF */
#define GPIO_CFGR_IOMC                      GPIO_CFGR_IOMC_Msk                      /*!< GPIO x mode configuration */

/*!< IOMC0 configuration */
#define GPIO_CFGR_IOMC0_Pos                 (0U)
#define GPIO_CFGR_IOMC0_Msk                 (0x3U << GPIO_CFGR_IOMC0_Pos)           /*!< 0x00000003 */
#define GPIO_CFGR_IOMC0                     GPIO_CFGR_IOMC0_Msk                     /*!< IOMC0[1:0] bits (GPIO x mode configuration, pin 0) */
#define GPIO_CFGR_IOMC0_0                   (0x1U << GPIO_CFGR_IOMC0_Pos)           /*!< 0x00000001 */
#define GPIO_CFGR_IOMC0_1                   (0x2U << GPIO_CFGR_IOMC0_Pos)           /*!< 0x00000002 */

